

text = 'Послідовність — це впорядкований контейнер елементів, проіндексованих цілими числам'
empty_row = ''

# element by index
#print(len(empty_row))
#print(len(text))

#print(text[0])  # П
#print(text[2])  # c

#print(text[-1])  # останній елемент
# print(text[-2])  # другий з кінця
#print(text[len(text) - 1])  # останній елемент, text[83 - 1]
# print(text[83])  # неіснуючий елемент - помилка
# print(empty_row[0])  # помилка



# ------------------------# slice
text = 'Послідовність — це впорядкований контейнер елементів, проіндексованих цілими числам'

# print(text[0:10])  # від нульового елемента до 10 НЕ включно 10й
# print(text[-20:-10])  # від 20 з кінця до 10 з кінця
# print(text[10:-10])  # від 10 з початку до 10 з кінця

# print(text[20:0:-1])  # від 20 до 0(задом на перед)
# print(text[::-1])  # задом на перед

# [start:end:step]
# по замовчуванню обов`язковий тільки end
# [:5] == [0:5:1]
# print(text[0:10:2])  # від нульового елемента до 10 НЕ включно 10й КОЖНИЙ ДРУГИЙ, 0,2,4,6,8
# print(text[1:11:2])  # від 1 елемента до 11 НЕ включно 11й КОЖНИЙ ДРУГИЙ, 1,3,5,7,9

# print(text[:10])  # [0:10:1] від нульового елемента до 10 НЕ включно 10й


list_of_numbers = [0,1,2,3,4,5,6,7,8,9,10]

print(list_of_numbers[0:5])
print(list_of_numbers[::-1])  # задом на перед
print(list_of_numbers[-3:0:-3])  # задом на перед кожний 3

print(list_of_numbers[20:0:-1])

# ids_for_check = all_ids[:20] # all_ids[:20] = all_ids[0:20:1]
